ELPasEDT/src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <owners>Catalog.Реагенты</owners>
  <owners>Catalog.Оборудование</owners>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

ELPasEDT/src/Catalogs/ЕдиницыИзмерения/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Коэффициент = 1;
		Если Параметры.ЗначенияЗаполнения.Свойство("ЕдиницаПоКлассификатору") Тогда
			Объект.Наименование = Параметры.ЗначенияЗаполнения.ЕдиницаПоКлассификатору;
		КонецЕсли;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.БазоваяЕдиницаИзмерения.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаПоКлассификаторуПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ЕдиницаПоКлассификатору) Тогда
		Объект.Наименование = Объект.ЕдиницаПоКлассификатору;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.БазоваяЕдиницаИзмерения) Тогда
		Объект.БазоваяЕдиницаИзмерения = Объект.ЕдиницаПоКлассификатору;
	КонецЕсли;
	
КонецПроцедуры
